# Taps
tap "homebrew/bundle"

# CLI Tools
brew "git"            # バージョン管理
brew "gh"             # GitHub CLI
brew "jq"             # JSON パーサー
brew "vim"            # テキストエディタ
brew "bat"            # cat 代替（シンタックスハイライト付き）
brew "trash"          # rm 代替（ゴミ箱に移動）
brew "zsh"            # シェル
brew "anyenv"         # 言語バージョン管理
brew "git-delta"      # git diff 改善
brew "eza"            # ls 代替（モダンUI）
brew "fd"             # find 代替（高速）
brew "ripgrep"        # grep 代替（高速）
brew "zoxide"         # cd 代替（スマートジャンプ）

# Zsh plugins
brew "zsh-completions"     # 追加の補完定義
brew "zsh-autosuggestions" # コマンド履歴からの自動補完

# Casks（GUIアプリ、必要に応じて追加）
# cask "visual-studio-code"
# cask "docker"
